{
	"name": "Amol Gajanan Nadagonde",
	"contact": {
		"mobile": 9545905268,
		"email": "amol.nadagonde@gmail.com"
	},
	"aboutMe": {
		"oneLiner": "I am a designer and developer, who likes to create trending websites and apps.",
		"objective": "To be a developer in a challenging and competitive environment where I can apply best of my knowledge and can improve my professional as well as personal skills.",
	},
	"experience": [
		{
			"company": "Atos Syntel",
			"role": "Consultant",
			"duration": "March 2018 - till date",
			"description": "Developingfeature modules for CYBG's banking application named as Be On Web.",
			"responsibilities": [
				"Developed a feature of re-ordering the accounts of the customer displayed on home page, using Flux and React.",
				"Worked with the database team for managing customer’s accounts with Clydesdale and Yorkshire Bank Group.",
				"Resolving issues related to RWD and React State Management in BoW app.",
				"Worked on the Kibana tool, to check the logs of customers and find the root cause of issues.",
				"Good knowledge of JIRA ticket management and Service Now incident management system."
			]
		},
		{
			"company": "DB Xento Systems",
			"role": "Sr. UI Developer",
			"duration": "Dec 2013 – March 2018",
			"description": "Making responsive website templates for the product ‘Marketing Templates’, fixing bugs using Javascript and CSS.",
			"responsibilities": [
				"Played an important role and mentored in the conversion of existing static websites to responsive ones.",
				"Styled content and website layout for the user experience using CSS3 and HTML5.",
				"Focused on the cross browser compatibility and W3C Validations.",
				"Helped other team members in solving the UI issues with javascript, jQuery and LESS-CSS.",
				"Created standards for showing alert messages in the system.",
				"Was part of UX Help Desk, where I was supposed to help other teams to implement the proposed functionality in their modules.",
				"Participated and provided input in code optimization and performance related meetings.",
				"Was part of team implementing the module pattern(library) in the responsive websites.",
				"Worked in implementing modifications in the customized form elements like dropdown, multi-select dropdown."
			]
		},
		{
			"company": "Magna Infotech (Client : Symantec )",
			"role": "Web Developer",
			"duration": "Feb 2013 – Nov 2013",
			"description": "Major task was to refactoring CSS for a product named NetBackup. Optimizing CSS using short-hand properties, grouping similar styles, etc. Making browser compatibility for the application.",
			"responsibilities": [
				"Removed unnecessary inline CSS styles and made application separate from design code and programming code.",
				"Worked on tools such as Balsamiq for making mockups for same application.",
				"Converted the table layout page structure into div based structure.",
				"Made prototyping with use of Fireworks.",
				"Made product layout consistent using Javascript and jQuery."
			]
		},
		{
			"company": "Pipal Web Design and Solutions.",
			"role": "Web Developer",
			"duration": "Feb 2012 – to Feb 2013",
			"description": "Worked on the on-going projects. HTML and CSS, Photoshop, Dreamweaver. Worked on slicing the images and making E-mailers. Made workflow of Project Management System in PlugCRM.",
			"responsibilities": [
				"Worked on 20+ websites related to property management in Pune.",
				"Coordinating with Graphic Designers for image editing and layouts.",
				"Created website banners for the clients.",
				"Worked on implementing GUI for Client Management, Project Management in .NET Projects."
			]
		},
		{
			"company": "Apex Innovations Private Limited, Kupwad MIDC, Sangli",
			"role": "Web Developer",
			"duration": "SEP 2010 – AUG 2011",
			"description": "LucidBit Technologies is one of the emerging parts of Apex Innovations. The main aim was to promote the product ICEngineSoft. It provided customers to be a User at website and download the manual and product upgrades.",
			"responsibilities": [
				"Presented designs and concepts to the Management for review.",
				"Responsible for the design of website right from conceptualization stage to its implementation through table-less HTML and CSS development.",
				"Implemented website’s form validation, authentication and authorization.",
				"Worked with Session Objects and SQL Membership Provider for making user accounts.",				
				"Developed SQL Database and related web interface respectively.",
				"Worked for making the user interface of ICEngineSoft including layout, buttons."
			]
		}
	]
}